src/InformationRegisters/СтруктураЗаказа/СтруктураЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтруктураЗаказа</name>
  <resources>
    <name>Требуется</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Запланировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РаспределеноИзЗапасовОбособленно</name>
    <comment>Ресурс для хранения результата распределения в обособленных складских запасов и в графике поступления обособленных заказов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РаспределеноИзЗапасов</name>
    <comment>Ресурс для хранения результата распределения в складских запасов и в графике поступления заказов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РаспределеноИзПартийОбособленно</name>
    <comment>Ресурс для хранения результата распределения в графике поступления обособленных производственных партий</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РаспределеноИзПартий</name>
    <comment>Ресурс для хранения результата распределения в графике поступления не обособленных производственных партий</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Запущено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Готово</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеОбеспечивать</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииДанных</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаЕдиницуПартииЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючСвязиСтрокаСпецификации</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСвязиПеремещение</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияПолуфабриката</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДоВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИзделий</name>
    <type>
      <types>DefinedType.ГруппаСтрокСтруктурыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСтруктуры</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючНоменклатура</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПартия</name>
    <comment>Идентификатор узла структуры заказа</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтроки</name>
    <type>
      <types>EnumRef.ВидыСтрокСтруктурыЗаказаНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПоступление</name>
    <type>
      <types>DefinedType.ОжидаемоеПоступление</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючНабор</name>
    <comment>Идентификатор набора для записи движений</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗаданияКРасчетуСтруктурыЗаказаСпецификации/ЗаданияКРасчетуСтруктурыЗаказаСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКРасчетуСтруктурыЗаказаСпецификации</name>
  <resources>
    <name>ПолныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Очередь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/СтруктураЗаказаВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ЗначенияЗаполненияДокументов

// Возвращает данные для формирование документов "Заказ на перемещение товаров" Или "Перемещение товаров", табличная часть заполняются изделиями готовыми к отгрузке со склада.
//
// Параметры:
//  ИдентификаторыСтрок - Массив - список ключей указывающих изделия в партии перемещения товаров.
//  ТолькоВНаличии - Булево - признак, если истина, то список номенклатуры запланированной к перемещению будет отфильтрован по наличию на складе отгрузки.
// Возвращаемое значение:
//  ТаблицаЗначений - содержит структуру параметров замены:
//  	* Номенклатура			 - СправочникСсылка.Номенклатура				 - номенклатура.
//  	* Характеристика		 - СправочникСсылка.ХарактеристикиНоменклатуры	 - характеристика номенклатуры.
//  	* СкладОтгрузки			 - СправочникСсылка.Склады						 - склад отгрузки.
//  	* СкладПоступления		 - СправочникСсылка.Склады						 - склад поступления.
//  	* Назначение			 - СправочникСсылка.Назначения					 - назначение.
//  	* Обособленно			 - Булево										 - признак, "обособленное обеспечение".
//  	* КоличествоУпаковок	 - Число										 - количество в упаковках.
//  	* Количество			 - Число										 - количество в ед.хранения товара.
//
Функция ТабличнаяЧастьПеремещениеИзделийПоНоменклатурномуПлану(ИдентификаторыСтрок, ТолькоВНаличии = Ложь) Экспорт

	ТабличнаяЧастьТовары = Новый Массив();
	
	ТаблицаЗначений = СтруктураЗаказаСлужебный.ТабличнаяЧастьПеремещениеИзделийПоНоменклатурномуПлану(ИдентификаторыСтрок, ТолькоВНаличии);
	
	Для каждого Строка Из ТаблицаЗначений Цикл
		
		СтрокаТовары = Новый Структура;
		
		СтрокаТовары.Вставить("ЖелаемаяДатаПоступления", Строка.ОкончаниеПоступления);
		
		СтрокаТовары.Вставить("СкладОтправитель",	  Строка.СкладОтправитель);
		СтрокаТовары.Вставить("СкладПолучатель",	  Строка.СкладПолучатель);
		СтрокаТовары.Вставить("НачалоОтгрузки",		  '00010101');
		СтрокаТовары.Вставить("ОкончаниеПоступления", '00010101');
		
		СтрокаТовары.Вставить("Номенклатура",		  Строка.Номенклатура);
		СтрокаТовары.Вставить("Характеристика",		  Строка.Характеристика);
		СтрокаТовары.Вставить("Назначение",			  Строка.Назначение);
		СтрокаТовары.Вставить(
			"ВариантОбеспечения",
			ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
			
		СтрокаТовары.Вставить("КоличествоУпаковок", Строка.Количество);
		СтрокаТовары.Вставить("Количество",         Строка.Количество);
		
		ТабличнаяЧастьТовары.Добавить(СтрокаТовары);
		
	КонецЦикла;
	
	Возврат ТабличнаяЧастьТовары;

КонецФункции

// Возвращает данные для формирование документов "Заказ на перемещение товаров" Или "Перемещение товаров", табличная часть заполняются комплектующими готовыми к отгрузке со склада.
//
// Параметры:
//  Изделие          - Структура - данные изделия для получения списка комплектующих к перемещению.
//  ЭтапПроизводства - СправочникСсылка.ЭтапыПроизводства - дополнительный отбор комплектующих по этапу производства.
//  ТолькоВНаличии - Булево - признак, если истина, то список номенклатуры запланированной к перемещению будет отфильтрован по наличию на складе отгрузки.
//  
// Возвращаемое значение:
//  ТаблицаЗначений - см.СтруктураЗаказаВызовСервера.ТабличнаяЧастьПеремещениеИзделийПоНоменклатурномуПлану
//
Функция ТабличнаяЧастьПеремещениеКомплектующихПоНоменклатурномуПлану(Изделие, ЭтапПроизводства = Неопределено, ТолькоВНаличии = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланПотребления.КлючНоменклатура КАК КлючНоменклатура
	|ИЗ
	|	РегистрСведений.СтруктураЗаказа КАК ПланПотребления
	|ГДЕ
	|	ПланПотребления.ВидСтроки В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Потребление))
	|	И ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрСведений.СтруктураЗаказа КАК ПланПроизводства
	|		ГДЕ
	|			&Изделие
	|			И ПланПроизводства.ВидСтроки В (
	|					ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции),
	|					ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПолуфабриката))
	|			И ПланПроизводства.КлючПартия = ПланПотребления.КлючПартия)
	|	И &Этап В (ПланПотребления.Этап, НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка))";
	
	ИмяТаблицы = "ПланПроизводства";
	ИмяПараметра = "Изделие";
	
	Список = Новый Массив();
	
	Для каждого Элемент Из Изделие Цикл
		Список.Добавить(ИмяТаблицы + "." + Элемент.Ключ + " = &" + Элемент.Ключ);
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&" + ИмяПараметра, СтрСоединить(Список, " " + "И" + " "));
	
	Для каждого Элемент Из Изделие Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Этап", ЭтапПроизводства);
	
	ТабличнаяЧастьТовары = ТабличнаяЧастьПеремещениеИзделийПоНоменклатурномуПлану(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0), ТолькоВНаличии);
	
	Возврат ТабличнаяЧастьТовары;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Добавляет задания к пересчету структуры заказа на производство и запускает расчет
// 
// Параметры:
// 	ЗаказыНаПроизводство - Массив, ДокументСсылка.ЗаказНаПроизводство2_2	- заказ на производство или список заказов на производство.
//
Процедура ЗапуститьПересчетСтруктурыЗаказа(ЗаказыНаПроизводство) Экспорт
	
	РегистрыСведений.ЗаданияКОчисткеСтруктурыЗаказа.ДобавитьЗадания(ЗаказыНаПроизводство);
	
	СтруктураЗаказа.ЗапуститьРасчет();
	
КонецПроцедуры

// Добавляет задания к расчету структуры заказа на производство по спецификации и запускает расчет
// 
// Параметры:
// 	Спецификация			 - СправочникСсылка.РесурсныеСпецификации			- спецификация.
// 	ЗаказыНаПроизводство	 - Массив, ДокументСсылка.ЗаказНаПроизводство2_2	- заказ на производство или список заказов на производство.
//
Процедура ЗапуститьПересчетСтруктурыЗаказаПоСпецификации(Спецификация, ЗаказыНаПроизводство) Экспорт
	
	СписокЗаказовНаПроизводство = ОбщегоНазначенияУТКлиентСервер.Массив(ЗаказыНаПроизводство);
	
	Задания = РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого ЗаказНаПроизводство Из СписокЗаказовНаПроизводство Цикл
		Задание = Задания.Добавить();
		Задание.Спецификация = Спецификация;
		Задание.ЗаказНаПроизводство = ЗаказНаПроизводство;
	КонецЦикла;
	
	РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаСпецификации.ДобавитьЗаданияПолныйРасчет(Задания, Истина);
	
	СтруктураЗаказа.ЗапуститьРасчет();
	
КонецПроцедуры

// Формирует полное представление заказа на производство.
// Формат: "Заказ № %1 от %2, дата потребности %3".
//
// Параметры:
//  НомерДокумента		 - Строка	 - номер документа.
//  ДатаДокумента		 - Дата 	 - дата документа.
//  ЖелаемаяДатаВыпуска	 - Дата 	 - желаемая дата.
//
// Возвращаемое значение:
//  Строка - полное представление заказа на производство.
//
Функция ПолноеПредставлениеЗаказа(НомерДокумента, ДатаДокумента, ЖелаемаяДатаВыпуска) Экспорт
	
	НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДокумента, Ложь, Истина);
	ДатаЗаказа  = Формат(ДатаДокумента, "ДЛФ=D");
	
	Если ЖелаемаяДатаВыпуска = '00010101' Тогда
		
		Шаблон = НСтр("ru = '№ %1 от %2';
						|en = 'No. %1 from %2'");
		Текст = СтрШаблон(Шаблон, НомерЗаказа, ДатаЗаказа);
		
	Иначе
		
		Шаблон = НСтр("ru = '№ %1 от %2, желаемая дата %3';
						|en = 'No. %1 dated %2, required date %3'");
		Текст = СтрШаблон(Шаблон, НомерЗаказа, ДатаЗаказа, Формат(ЖелаемаяДатаВыпуска, "ДЛФ=D"));
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти
